{"Responsorial_Psalm": {"narrative": ["", "R.    (1)  ", "Keep me safe, O God; you are my hope.", "or:", "R.    ", "Alleluia.", "Keep me, O God, for in you I take refuge;", "I say to the LORD, “My Lord are you.”", "O LORD, my allotted portion and my cup,", "you it is who hold fast my lot.", "R.    ", "Keep me safe, O God; you are my hope.", "or:", "R.    ", "Alleluia.", "I bless the LORD who counsels me;", "even in the night my heart exhorts me.", "I set the LORD ever before me;", "with him at my right hand I shall not be disturbed.", "R.    ", "Keep me safe, O God; you are my hope.", "or:", "R.    ", "Alleluia.", "Therefore my heart is glad and my soul rejoices,", "my body, too, abides in confidence;", "Because you will not abandon my soul to the nether world,", "nor will you suffer your faithful one to undergo corruption.", "R.    ", "Keep me safe, O God; you are my hope.", "or:", "R.    ", "Alleluia.", "You will show me the path to life,", "fullness of joys in your presence,", "the delights at your right hand forever.", "R.    ", "Keep me safe, O God; you are my hope.", "or:", "R.    ", "Alleluia.", ""], "source": "16:1-2a and 5, 7-8, 9-10, 11"}, "date": "04/13/2020", "Reading_1": {"narrative": [" On the day of Pentecost, Peter stood up with the Eleven, raised his voice, and proclaimed: “You who are Jews, indeed all of you staying in Jerusalem.", " Let this be known to you, and listen to my words.", " “You who are children of Israel, hear these words.", " Jesus the Nazorean was a man commended to you by God with mighty deeds, wonders, and signs, which God worked through him in your midst, as you yourselves know.", " This man, delivered up by the set plan and foreknowledge of God, you killed, using lawless men to crucify him.", " But God raised him up, releasing him from the throes of death, because it was impossible for him to be held by it.", " For David says of him: I saw the Lord ever before me, with him at my right hand I shall not be disturbed.", " Therefore my heart has been glad and my tongue has exulted; my flesh, too, will dwell in hope, because you will not abandon my soul to the nether world, nor will you suffer your holy one to see corruption.", " You have made known to me the paths of life; you will fill me with joy in your presence.", " My brothers, one can confidently say to you about the patriarch David that he died and was buried, and his tomb is in our midst to this day.", " But since he was a prophet and knew that God had sworn an oath to him that he would set one of his descendants upon his throne, he foresaw and spoke of the resurrection of the Christ, that neither was he abandoned to the netherworld nor did his flesh see corruption.", " God raised this Jesus; of this we are all witnesses.", " Exalted at the right hand of God, he poured forth the promise of the Holy Spirit that he received from the Father, as you both see and hear.”"], "source": "Acts 2:14, 22-33"}, "Alleluia": {"narrative": ["", "R. ", "Alleluia, alleluia.", "This is the day the LORD has made;", "let us be glad and rejoice in it.", "R. ", "Alleluia, alleluia.", ""], "source": " Ps 118:24"}, "Gospel": {"narrative": [" Mary Magdalene and the other Mary went away quickly from the tomb, fearful yet overjoyed, and ran to announce the news to his disciples.", " And behold, Jesus met them on their way and greeted them.", " They approached, embraced his feet, and did him homage.", " Then Jesus said to them, “Do not be afraid.", " Go tell my brothers to go to Galilee, and there they will see me.” While they were going, some of the guard went into the city and told the chief priests all that had happened.", " The chief priests assembled with the elders and took counsel; then they gave a large sum of money to the soldiers, telling them, “You are to say, ‘His disciples came by night and stole him while we were asleep.’ And if this gets to the ears of the governor, we will satisfy him and keep you out of trouble.” The soldiers took the money and did as they were instructed.", " And this story has circulated among the Jews to the present day."], "source": "Mt 28:8-15"}, "description": "Monday in the Octave of Easter", "lectionary": ""}