{"lectionary": "", "date": "04/12/2020", "Gospel": {"source": "Jn 20:1-9", "narrative": [" On the first day of the week, Mary of Magdala came to the tomb early in the morning, while it was still dark, and saw the stone removed from the tomb.", " So she ran and went to Simon Peter and to the other disciple whom Jesus loved, and told them, “They have taken the Lord from the tomb, and we don’t know where they put him.” So Peter and the other disciple went out and came to the tomb.", " They both ran, but the other disciple ran faster than Peter and arrived at the tomb first; he bent down and saw the burial cloths there, but did not go in.", " When Simon Peter arrived after him, he went into the tomb and saw the burial cloths there, and the cloth that had covered his head, not with the burial cloths but rolled up in a separate place.", " Then the other disciple also went in, the one who had arrived at the tomb first, and he saw and believed.", " For they did not yet understand the Scripture that he had to rise from the dead."]}, "Reading_1": {"source": "Acts 10:34a, 37-43", "narrative": [" Peter proceeded to speak and said: \"You know what has happened all over Judea, beginning in Galilee after the baptism that John preached, how God anointed Jesus of Nazareth with the Holy Spirit and power.", " He went about doing good and healing all those oppressed by the devil, for God was with him.", " We are witnesses of all that he did both in the country of the Jews and in Jerusalem.", " They put him to death by hanging him on a tree.", " This man God raised on the third day and granted that he be visible, not to all the people, but to us, the witnesses chosen by God in advance, who ate and drank with him after he rose from the dead.", " He commissioned us to preach to the people and testify that he is the one appointed by God as judge of the living and the dead.", " To him all the prophets bear witness, that everyone who believes in him will receive forgiveness of sins through his name"]}, "Responsorial_Psalm": {"source": "Ps 118:1-2, 16-17, 22-23.", "narrative": ["R. (24) ", "This is the day the Lord has made; let us rejoice and be glad.", "or:", "R. ", "Alleluia.", "Give thanks to the LORD, for he is good,", "for his mercy endures forever.", "Let the house of Israel say,", "“His mercy endures forever.”", "R. ", "This is the day the Lord has made; let us rejoice and be glad.", "or:", "R. ", "Alleluia.", "“The right hand of the LORD has struck with power;", "the right hand of the LORD is exalted.", "I shall not die, but live,", "and declare the works of the LORD.”", "R. ", "This is the day the Lord has made; let us rejoice and be glad.", "or:", "R. ", "Alleluia.", "The stone which the builders rejected", "has become the cornerstone.", "By the LORD has this been done;", "it is wonderful in our eyes.", "R. ", "This is the day the Lord has made; let us rejoice and be glad.", "or:", "R. ", "Alleluia."]}, "description": "Easter Sunday of the Resurrection of the Lord", "Alleluia": {"source": " Cf. 1 Cor 5:7b-8a", "narrative": ["", "R. ", "Alleluia, alleluia.", "Christ, our paschal lamb, has been sacrificed;", "let us then feast with joy in the Lord.", "R. ", "Alleluia, alleluia."]}, "Reading_2": {"source": "Col 3:1-4", "narrative": [" Brothers and sisters: If then you were raised with Christ, seek what is above, where Christ is seated at the right hand of God.", " Think of what is above, not of what is on earth.", " For you have died, and your life is hidden with Christ in God.", " When Christ your life appears, then you too will appear with him in glory.", " or I Cor 5:6b-8 Brothers and sisters: Do you not know that a little yeast leavens all the dough?", " Clear out the old yeast, so that you may become a fresh batch of dough, inasmuch as you are unleavened.", " For our paschal lamb, Christ, has been sacrificed.", " Therefore, let us celebrate the feast, not with the old yeast, the yeast of malice and wickedness, but with the unleavened bread of sincerity and truth.", " Sequence victimae paschali laudes Christians, to the Paschal Victim Offer your thankful praises!", " A Lamb the sheep redeems; Christ, who only is sinless, Reconciles sinners to the Father.", " Death and life have contended in that combat stupendous: The Prince of life, who died, reigns immortal.", " Speak, Mary, declaring What you saw, wayfaring.", " “The tomb of Christ, who is living, The glory of Jesus’ resurrection; bright angels attesting, The shroud and napkin resting.", " Yes, Christ my hope is arisen; to Galilee he goes before you.” Christ indeed from death is risen, our new life obtaining.", " Have mercy, victor King, ever reigning!", " Amen. Allelui"]}}