{"Reading_1": {"source": "HAB 1:12—2:4", "narrative": [" Are you not from eternity, O LORD, my holy God, immortal?", " O LORD, you have marked him for judgment, O Rock, you have readied him punishment!", " Too pure are your eyes to look upon evil, and the sight of misery you cannot endure.", " Why, then, do you gaze on the faithless in silence while the wicked man devours one more just than himself?", " You have made man like the fish of the sea, like creeping things without a ruler.", " He brings them all up with his hook, he hauls them away with his net, He gathers them in his seine; and so he rejoices and exults.", " Therefore he sacrifices to his net, and burns incense to his seine; for thanks to them his portion is generous, and his repast sumptuous.", " Shall he, then, keep on brandishing his sword to slay peoples without mercy?I will stand at my guard post, and station myself upon the rampart, And keep watch to see what he will say to me, and what answer he will give to my complaint.", " Then the LORD answered me and said: Write down the vision Clearly upon the tablets, so that one can read it readily.", " For the vision still has its time, presses on to fulfillment, and will not disappoint; If it delays, wait for it, it will surely come, it will not be late.", " The rash man has no integrity; but the just man, because of his faith, shall live."]}, "description": "Memorial of Saint Dominic, Priest\n                                                                ", "lectionary": "Lectionary: 412", "Antiphon_1": {"source": "", "narrative": ["Cf. Sir 15: 5", "", "In the midst of the Church he opened his mouth,", "and the Lord filled him with the spirit of wisdom and understanding", "and clothed him in a robe of glory."]}, "Prayer_after_Communion": {"source": "", "narrative": ["May your Church, O Lord,", "receive with wholehearted reverence", "the power of this heavenly Sacrament,", "by which we have been nourished", "on the commemoration of Saint Dominic,", "and may your Church,", "having flourished by means of his preaching,", "be helped through his intercession.", "Through Christ our Lord."]}, "Responsorial_Psalm": {"source": "PS 9:8-9, 10-11, 12-13 ", "narrative": ["R. (11b) ", "You forsake not those who seek you, O Lord.", "The LORD sits enthroned forever;", "he has set up his throne for judgment.", "He judges the world with justice;", "he governs the peoples with equity.", "R. ", "You forsake not those who seek you, O Lord.", "The LORD is a stronghold for the oppressed,", "a stronghold in times of distress.", "They trust in you who cherish your name,", "for you forsake not those who seek you, O LORD.", "R. ", "You forsake not those who seek you, O Lord.", "Sing praise to the LORD enthroned in Zion;", "proclaim among the nations his deeds;", "For the avenger of blood has remembered;", "he has not forgotten the cry of the poor.", "R. ", "You forsake not those who seek you, O Lord.", "", ""]}, "Alleluia": {"source": "2 TM 1:10 ", "narrative": ["R. ", "Alleluia, alleluia.", "Our Savior Jesus Christ has destroyed death", "and brought life to light through the Gospel.", "R. ", "Alleluia, alleluia."]}, "Gospel": {"source": "MT 17:14-20 ", "narrative": [" A man came up to Jesus, knelt down before him, and said, “Lord, have pity on my son, who is a lunatic and suffers severely; often he falls into fire, and often into water.", " I brought him to your disciples, but they could not cure him.” Jesus said in reply, “O faithless and perverse generation, how long will I be with you?", " How long will I endure you?    Bring the boy here to me.” Jesus rebuked him and the demon came out of him, and from that hour the boy was cured.", " Then the disciples approached Jesus in private and said, “Why could we not drive it out?” He said to them, “Because of your little faith.", " Amen, I say to you, if you have faith the size of a mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move.", " Nothing will be impossible for you.”"]}, "Prayer_over_the_Offerings": {"source": "", "narrative": ["Attend mercifully to the prayers we offer you, O Lord,", "by the intercession of Saint Dominic,", "and through the great power of this sacrifice", "strengthen by the protection of your grace", "those who champion the faith.", "Through Christ our Lord.", "", "Preface of Holy Pastors."]}, "Antiphon_2": {"source": "", "narrative": ["Lk 12: 42", "", "This is the steward, faithful and prudent,", "whom the Lord set over his household", "to give them their allowance of food at the proper time."]}, "date": "08/08/2020", "Collect": {"source": "", "narrative": ["May Saint Dominic come to the help of your Church", "by his merits and teaching, O Lord,", "and may he, who was an outstanding preacher of your truth,", "be a devoted intercessor on our behalf.", "Through our Lord Jesus Christ, your Son,", "who lives and reigns with you in the unity of the Holy Spirit,", "one God, for ever and ever."]}}