{"Reading_1": {"source": "1 KGS 19:9A, 11-13A", "narrative": [" At the mountain of God, Horeb, Elijah came to a cave where he took shelter.   Then the LORD said to him, “Go outside and stand on the mountain before the LORD; the LORD will be passing by.”   A strong and heavy wind was rending the mountains and crushing rocks before the LORD— but the LORD was not in the wind.   After the wind there was an earthquake— but the LORD was not in the earthquake.   After the earthquake there was fire— but the LORD was not in the fire.   After the fire there was a tiny whispering sound.   When he heard this, Elijah hid his face in his cloak and went and stood at the entrance of the cave."]}, "description": "Nineteenth Sunday in Ordinary Time\n                                                                ", "lectionary": "Lectionary: 115", "Antiphon_1": {"source": "", "narrative": ["Cf. Ps 74 (73): 20, 19, 22, 23", "", "Look to your covenant, O Lord,", "and forget not the life of your poor ones for ever.", "Arise, O God, and defend our cause,", "and forget not the cries of those who seek you.", "", ""]}, "Prayer_after_Communion": {"source": "", "narrative": ["May the communion in your Sacrament", "that we have consumed, save us, O Lord,", "and confirm us in the light of your truth.", "Through Christ our Lord.", "", ""]}, "Responsorial_Psalm": {"source": "PS 85:9, 10, 11-12, 13-14 ", "narrative": ["R. (8) ", "Lord, let us see your kindness, and grant us your salvation.", "I will hear what God proclaims;", "the LORD — for he proclaims peace.", "Near indeed is his salvation to those who fear him,", "glory dwelling in our land.", "R. ", "Lord, let us see your kindness, and grant us your salvation.", "Kindness and truth shall meet;", "justice and peace shall kiss.", "Truth shall spring out of the earth,", "and justice shall look down from heaven.", "R. ", "Lord, let us see your kindness, and grant us your salvation.", "The LORD himself will give his benefits;", "our land shall yield its increase.", "Justice shall walk before him,", "and prepare the way of his steps.", "R. ", "Lord, let us see your kindness, and grant us your salvation."]}, "Alleluia": {"source": "PS 130:5", "narrative": ["R. ", "Alleluia, alleluia.", "I wait for the Lord;", "my soul waits for his word.", "R. ", "Alleluia, alleluia."]}, "Gospel": {"source": "MT 14:22-33 ", "narrative": [" After he had fed the people, Jesus made the disciples get into a boat and precede him to the other side, while he dismissed the crowds.   After doing so, he went up on the mountain by himself to pray.   When it was evening he was there alone.   Meanwhile the boat, already a few miles offshore, was being tossed about by the waves, for the wind was against it.   During the fourth watch of the night, he came toward them walking on the sea.   When the disciples saw him walking on the sea they were terrified.   “It is a ghost,” they said, and they cried out in fear.   At once Jesus spoke to them, “Take courage, it is I; do not be afraid.”   Peter said to him in reply, “Lord, if it is you, command me to come to you on the water.”   He said, “Come.”   Peter got out of the boat and began to walk on the water toward Jesus.   But when he saw how strong the wind was he became frightened; and, beginning to sink, he cried out, “Lord, save me!”   Immediately Jesus stretched out his hand and caught Peter, and said to him, “O you of little faith, why did you doubt?”   After they got into the boat, the wind died down.   Those who were in the boat did him homage, saying, “Truly, you are the Son of God.”"]}, "Prayer_over_the_Offerings": {"source": "", "narrative": ["Be pleased, O Lord, to accept the offerings of your Church,", "for in your mercy you have given them to be offered", "and by your power you transform them", "into the mystery of our salvation.", "Through Christ our Lord."]}, "Antiphon_2": {"source": "", "narrative": ["Ps 147: 12, 14", "", "O Jerusalem, glorify the Lord,", "who gives you your fill of finest wheat.", "", "Or: Jn 6: 51", "", "The bread that I will give, says the Lord,", "is my flesh for the life of the world."]}, "Reading_2": {"source": "ROM 9:1-5 ", "narrative": [" Brothers and sisters: I speak the truth in Christ, I do not lie; my conscience joins with the Holy Spirit in bearing me witness that I have great sorrow and constant anguish in my heart.   For I could wish that I myself were accursed and cut off from Christ for the sake of my own people, my kindred according to the flesh.   They are Israelites; theirs the adoption, the glory, the covenants, the giving of the law, the worship, and the promises; theirs the patriarchs, and from them, according to the flesh, is the Christ, who is over all, God blessed forever. Amen."]}, "date": "08/09/2020", "Collect": {"source": "", "narrative": ["Almighty ever-living God,", "whom, taught by the Holy Spirit,", "we dare to call our Father,", "bring, we pray, to perfection in our hearts", "the spirit of adoption as your sons and daughters,", "that we may merit to enter into the inheritance", "which you have promised.", "Through our Lord Jesus Christ, your Son,", "who lives and reigns with you in the unity of the Holy Spirit,", "one God, for ever and ever."]}}