{"08/07/2020": {"story_title": "Saint Cajetan’s Story", "description": "Saint of the Day for August 7", "saint": "Saint Cajetan", "patron": [], "lifetime": "(October 1, 1480 – August 7, 1547)", "img_link": "https://www.franciscanmedia.org/wp-content/uploads/2016/08/8-7-Saint-Cajetan.jpg", "reflection": ["If Vatican II had been summarily stopped after its first session in 1962, many Catholics would have felt that a great blow had been dealt to the growth of the Church. Cajetan had the same feeling about the Council of Trent, held from 1545 to 1563. But as he said, God is the same in Naples as in Venice, with or without Trent or Vatican II. We open ourselves to God’s power in whatever circumstances we find ourselves, and God’s will is done. God’s standards of success differ from ours."], "narrative": ["Like most of us, Cajetan seemed headed for an “ordinary” life—first as a lawyer, then as a priest engaged in the work of the Roman Curia.", "His life took a characteristic turn when he joined the Oratory of Divine Love in Rome, a group devoted to piety and charity, shortly after his ordination at 36. When he was 42 he founded a hospital for incurables at Venice. At Vicenza, he joined a “disreputable” religious community that consisted only of men of the lowest stations of life—and was roundly censured by his friends, who thought his action was a reflection on his family. He sought out the sick and poor of the town and served them.", "The greatest need of the time was the reformation of a Church that was “sick in head and members.” Cajetan and three friends decided that the best road to reformation lay in reviving the spirit and zeal of the clergy. Together they founded a congregation known as the Theatines—from Teate [Chieti] where their first superior-bishop had his see. One of the friends later became Pope Paul IV.", "They managed to escape to Venice after their house in Rome was wrecked when Emperor Charles V’s troops sacked Rome in 1527. The Theatines were outstanding among the Catholic reform movements that took shape before the Protestant Reformation. Cajetan founded a monte de pieta—“mountain or fund of piety”—in Naples, one of many charitable, nonprofit credit organizations that lent money on the security of pawned objects. The purpose was to help the poor and protect them against usurers. Cajetan’s little organization ultimately became the Bank of Naples, with great changes in policy."]}}