{"Reading_1": {"source": "NA 2:1, 3; 3:1-3, 6-7", "narrative": [" See, upon the mountains there advances the bearer of good news,   announcing peace!", " Celebrate your feasts, O Judah, fulfill your vows!", " For nevermore shall you be invaded by the scoundrel; he is completely destroyed.", " The LORD will restore the vine of Jacob, the pride of Israel, Though ravagers have ravaged them   and ruined the tendrils.Woe to the bloody city, all lies, full of plunder, whose looting never stops!", " The crack of the whip, the rumbling sounds of wheels; horses a-gallop, chariots bounding,   Cavalry charging, the flame of the sword, the flash of the spear, the many slain, the heaping corpses, the endless bodies to stumble upon!", " I will cast filth upon you, disgrace you and put you to shame; Till everyone who sees you runs from you, saying, “Nineveh is destroyed; who can pity her?", " Where can one find any to console her?”"]}, "description": "Friday of the Eighteenth Week in Ordinary Time\n                                                                ", "lectionary": "Lectionary: 411", "Antiphon_1": {"source": "", "narrative": ["Cf. Ps 70 (69): 2, 6", "", "O God, come to my assistance;", "O Lord, make haste to help me!", "You are my rescuer, my help;", "O Lord, do not delay."]}, "Prayer_after_Communion": {"source": "", "narrative": ["Accompany with constant protection, O Lord,", "those you renew with these heavenly gifts", "and, in your never-failing care for them,", "make them worthy of eternal redemption.", "Through Christ our Lord."]}, "Responsorial_Psalm": {"source": "DEUTERONOMY 32:35CD-36AB, 39ABCD, 41 ", "narrative": ["R. (39c) ", "It is I who deal death and give life.", "Close at hand is the day of their disaster,", "and their doom is rushing upon them!", "Surely, the LORD shall do justice for his people;", "on his servants he shall have pity.", "R. ", "It is I who deal death and give life.", "“Learn then that I, I alone, am God,", "and there is no god besides me.", "It is I who bring both death and life,", "I who inflict wounds and heal them.”", "R. ", "It is I who deal death and give life.", "I will sharpen my flashing sword,", "and my hand shall lay hold of my quiver,", "“With vengeance I will repay my foes", "and requite those who hate me.”", "R. ", "It is I who deal death and give life.", "", "", "", ""]}, "Alleluia": {"source": "MATTHEW 5:10 ", "narrative": ["R. ", "Alleluia, alleluia.", "Blessed are they who are persecuted for the sake of righteousness;", "for theirs is the Kingdom of heaven.", "R. ", "Alleluia, alleluia."]}, "Gospel": {"source": "MT 16:24-28 ", "narrative": [" Jesus said to his disciples, “Whoever wishes to come after me must deny himself, take up his cross, and follow me.", " For whoever wishes to save his life will lose it, but whoever loses his life for my sake will find it.", " What profit would there be for one to gain the whole world and forfeit his life?", " Or what can one give in exchange for his life?", " For the Son of Man will come with his angels in his Father’s glory, and then he will repay each according to his conduct.", " Amen, I say to you, there are some standing here who will not taste death until they see the Son of Man coming in his Kingdom.”"]}, "Prayer_over_the_Offerings": {"source": "", "narrative": ["Graciously sanctify these gifts, O Lord, we pray,", "and, accepting the oblation of this spiritual sacrifice,", "make of us an eternal offering to you.", "Through Christ our Lord."]}, "Antiphon_2": {"source": "", "narrative": ["Wis 16: 20", "", "You have given us, O Lord, bread from heaven,", "endowed with all delights and sweetness in every taste.", "", "Or: Jn 6: 35", "", "I am the bread of life, says the Lord;", "whoever comes to me will not hunger", "and whoever believes in me will not thirst."]}, "date": "08/07/2020", "Collect": {"source": "", "narrative": ["Draw near to your servants, O Lord,", "and answer their prayers with unceasing kindness,", "that, for those who glory in you as their Creator and guide,", "you may restore what you have created", "and keep safe what you have restored.", "Through our Lord Jesus Christ, your Son,", "who lives and reigns with you in the unity of the Holy Spirit,", "one God, for ever and ever."]}}